// 1.Ця програма виконує наступні дії:

// Імпортує бібліотеку iostream, що дозволяє працювати зі введенням та виведенням даних.
// Задає функцію main, яка є точкою входу в програму.
// Ініціалізує змінні x і y зі значеннями 5 і 7 відповідно.
// Виводить порожній рядок для візуального розділення виведених результатів.
// Виводить суму x + y та добуток x * y через пробіл.
// Знову виводить порожній рядок.
// Повертає 0, що вказує на успішне завершення програми.
// Після виконання програма виведе суму та добуток чисел 5 і 7, розділені пробілом
// 2
#include <iostream>
using namespace std;
int main()
{
  int x = 5;
  int y = 7;
  cout << "\n";
  cout << x + y << " " << x * y;
  cout << "\n";
  return 0;
}
// Вивід: 12 35
// 3
#include <iostream>
using namespace std;
int main()
{
 cout << "Hello World\n";
 return 0;
}
// Після компіляції цієї програми я отримав повідомлення про помилку, оскільки відсутній символ < перед include. Тут можливі два варіанти помилки:

// Якщо ви скомпілюєте програму в середовищі розробки, то ви побачите повідомлення про помилку про відсутність символу <.
// Якщо ви скомпілюєте програму в терміналі, то також отримаєте повідомлення про помилку щодо відсутності символу <

// 4
#include <iostream>
using namespace std;
int main()
{
 cout << "Hello World\n";
 return 0;
}
// Ця програма виводить на екран фразу "Hello World" з новим рядком перед та після неї
