// 1 Напишіть програму, яка відображає повідомлення I love C++.
// #include <iostream>
// using namespace std;
//
// int main()
// {
//     cout << "I love C++";
//     return 0;
// }
// Напишіть найменшу програму, яку можна скомпілювати, скомпонувати та виконати.
// int main() {
//     return 0;
// }
// 3 Баги: введіть цю програму та скомпілюйте її. Чому вона дає збій? Як це можна виправити?
//
//
//
// #include <iostream>
// using namespace std;
//
// int main()
// {
//     cout << Is there a bug here?"
//     return 0;
// }
//Програма містить синтаксичну помилку через відсутність лапок у вказівці cout. Щоб виправити цю помилку, необхідно додати лапки навколо рядка, який  потрібно написати
// 4. Виправте помилку в вправі 3, після чого перекомпілюйте її, скомпонуйте і запустіть на виконання.
#include <iostream>
using namespace std;

int main()
{
    cout << "Is there a bug here?";
    return 0;
}
